bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY84A.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATtiny84A-CCU" package="UFBGA16" pinout="BGA_16" speedmax="20000000" tempmax="85"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny84A-MMH" package="VQFN20" pinout="QFN_20" speedmax="20000000" tempmax="85"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny84A-MU" package="QFN20" pinout="QFN_20" speedmax="20000000" tempmax="85" tempmin="-40"
                 vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny84A-PU" package="PDIP14" pinout="SOIC_14" speedmax="20000000" tempmax="85"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny84A-SSU" package="SOIC14" pinout="SOIC_14" speedmax="20000000" tempmax="85"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
        <variant ordercode="ATtiny84A-SSF" package="SOIC14" pinout="SOIC_14" speedmax="20000000" tempmax="125"
                 tempmin="-40" vccmax="5.5" vccmin="1.8"/>
    </variants>
    <device name="ATtiny84A" architecture="AVR8" avr-family="tinyAVR" family="AVR8">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x2000">
                <memory-segment start="0x0000" size="0x2000" type="flash" rw="RW" exec="1" name="FLASH"
                                pagesize="0x40"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0260">
                <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                <memory-segment name="MAPPED_IO" start="0x0020" size="0x0040" type="io" external="false"/>
                <memory-segment name="IRAM" start="0x0060" size="0x0200" type="ram" external="false"/>
            </address-space>
            <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0200">
                <memory-segment start="0x0000" size="0x0200" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                pagesize="0x04"/>
            </address-space>
            <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
                <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="PORT">
                <instance name="PORTA" caption="I/O Port">
                    <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal function="PORTA" group="P" index="0" pad="PA0"/>
                        <signal function="PORTA" group="P" index="1" pad="PA1"/>
                        <signal function="PORTA" group="P" index="2" pad="PA2"/>
                        <signal function="PORTA" group="P" index="3" pad="PA3"/>
                        <signal function="PORTA" group="P" index="4" pad="PA4"/>
                        <signal function="PORTA" group="P" index="5" pad="PA5"/>
                        <signal function="PORTA" group="P" index="6" pad="PA6"/>
                        <signal function="PORTA" group="P" index="7" pad="PA7"/>
                    </signals>
                </instance>
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal function="PORTB" group="P" index="0" pad="PB0"/>
                        <signal function="PORTB" group="P" index="1" pad="PB1"/>
                        <signal function="PORTB" group="P" index="2" pad="PB2"/>
                        <signal function="PORTB" group="P" index="3" pad="PB3"/>
                    </signals>
                </instance>
            </module>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                    caption="Analog Comparator"/>
                    <signals>
                        <signal function="ACIN" group="AIN" index="0" pad="PA1"/>
                        <signal function="ACIN" group="AIN" index="1" pad="PA2"/>
                    </signals>
                </instance>
            </module>
            <module name="ADC">
                <instance name="ADC" caption="Analog-to-Digital Converter">
                    <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"
                                    caption="Analog-to-Digital Converter"/>
                    <signals>
                        <signal function="ADC" group="ADC" index="0" pad="PA0"/>
                        <signal function="ADC" group="ADC" index="1" pad="PA1"/>
                        <signal function="ADC" group="ADC" index="2" pad="PA2"/>
                        <signal function="ADC" group="ADC" index="3" pad="PA3"/>
                        <signal function="ADC" group="ADC" index="4" pad="PA4"/>
                        <signal function="ADC" group="ADC" index="5" pad="PA5"/>
                        <signal function="ADC" group="ADC" index="6" pad="PA6"/>
                        <signal function="ADC" group="ADC" index="7" pad="PA7"/>
                        <signal function="AREF" group="AREF" pad="PA0"/>
                    </signals>
                </instance>
            </module>
