bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY84A.xml
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1"
                          ocd-rw="R">
                    <bitfield caption="Clear temporary page buffer" mask="0x10" name="CTPB"/>
                    <bitfield caption="Read fuse and lock bits" mask="0x08" name="RFLB"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Power Reduction Register" name="PRR" offset="0x20" size="1">
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x04" name="PRTIM0"/>
                    <bitfield caption="Power Reduction USI" mask="0x02" name="PRUSI"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x51" size="1" mask="0xFF"
                          ocd-rw="R">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x46" size="1">
                    <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x03FF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Pull-up Disable" mask="0x40" name="PUD"/>
                    <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
                    <bitfield caption="Sleep Mode Select Bits" mask="0x18" name="SM" values="CPU_SLEEP_MODE"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x35" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x34" size="1" mask="0xFF"/>
                <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x33" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Standby" name="STDBY" value="0x03"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="SOIC_14">
            <pin pad="VCC" position="1"/>
            <pin pad="PB0" position="2"/>
            <pin pad="PB1" position="3"/>
            <pin pad="PB3" position="4"/>
            <pin pad="PB2" position="5"/>
            <pin pad="PA7" position="6"/>
            <pin pad="PA6" position="7"/>
            <pin pad="PA5" position="8"/>
            <pin pad="PA4" position="9"/>
            <pin pad="PA3" position="10"/>
            <pin pad="PA2" position="11"/>
            <pin pad="PA1" position="12"/>
            <pin pad="PA0" position="13"/>
            <pin pad="GND" position="14"/>
        </pinout>
        <pinout name="QFN_20">
            <pin pad="PA4" position="1"/>
            <pin pad="PA3" position="2"/>
            <pin pad="PA2" position="3"/>
            <pin pad="PA1" position="4"/>
            <pin pad="PA0" position="5"/>
            <pin pad="NC" position="6"/>
            <pin pad="NC" position="7"/>
            <pin pad="GND" position="8"/>
            <pin pad="VCC" position="9"/>
            <pin pad="NC" position="10"/>
            <pin pad="PB0" position="11"/>
            <pin pad="PB1" position="12"/>
            <pin pad="PB3" position="13"/>
            <pin pad="PB2" position="14"/>
            <pin pad="PA7" position="15"/>
            <pin pad="PA6" position="16"/>
            <pin pad="NC" position="17"/>
            <pin pad="NC" position="18"/>
            <pin pad="NC" position="19"/>
            <pin pad="PA5" position="20"/>
        </pinout>
        <pinout name="BGA_16">
            <pin pad="NC" position="A1"/>
            <pin pad="PA5" position="A2"/>
            <pin pad="PA6" position="A3"/>
            <pin pad="PB2" position="A4"/>
            <pin pad="PA4" position="B1"/>
            <pin pad="PA7" position="B2"/>
            <pin pad="PB1" position="B3"/>
            <pin pad="PB3" position="B4"/>
            <pin pad="PA3" position="C1"/>
            <pin pad="PA2" position="C2"/>
            <pin pad="PA1" position="C3"/>
            <pin pad="PB0" position="C4"/>
            <pin pad="PA0" position="D1"/>
            <pin pad="GND" position="D2"/>
            <pin pad="GND" position="D3"/>
            <pin pad="VCC" position="D4"/>
        </pinout>
    </pinouts>
</target-description-file>
